tutorials/multiphase/interFoam/ras/waterChannel/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          200;
        startFace       79800;
    }
    walls
    {
        type            wall;
        nFaces          6600;
        startFace       80000;
    }
    outlet
    {
        type            patch;
        nFaces          200;
        startFace       86600;
    }
    atmosphere
    {
        type            patch;
        nFaces          1400;
        startFace       86800;
    }
)

// ************************************************************************* //
